'''Задача 2:
Проверить, пуста ли строка.
Пример:
python
КопироватьРедактировать
s = ""
# ожидаемый вывод: True
'''

s = ''

if not s:
    answer = True
else:
    answer = False

print(f'\nWe are going to check is string ->{s}<- empty string or not?\nAnd answer is {answer}')